[MZMachWeave X2EquipmentTemplate]
FriendlyName="Mach Weave"
FriendlyNamePlural="Mach Weaves"
BriefSummary="Stock body armor with Mach Weave anticipates and augments an Agent's sudden movements."
TacticalText="<Bullet/> Grants a massive bonus to dodge.<br/><Bullet/> Ideal if combined with other sources of dodge, to minimize the chances of regular or critical hits." 

[MZMachWeaveAbility X2AbilityTemplate]
LocFriendlyName="Mach Weave"
LocLongDescription="Grants a massive bonus to dodge."
LocHelpText="Grants a massive bonus to dodge."
LocFlyOverText="Mach Weave"

[MZStealthWeave X2EquipmentTemplate]
FriendlyName="Spectral Weave"
FriendlyNamePlural="Spectral Weaves"
BriefSummary="Spectral Weave provides adaptive camoflauge that allows the soldier to remain concealed when the squad is revealed."
TacticalText="<Bullet/> Even if the squad does not start a mission concealed, the wearer will still begin the mission with concealment.<br/><Bullet/> If the wearer is the soldier that breaks squad concealment, then Spectral Weave does not apply.<br/>"

[MZFluxWeave X2EquipmentTemplate]
FriendlyName="Flux Weave"
FriendlyNamePlural="Flux Weaves"
BriefSummary="Body armor with Flux Weave keeps a soldier steady when they might otherwise have impaired thoughts."
TacticalText="<Bullet/> Grants immunity to Disorientation, Stun and Unconciousness." 

[MZFluxWeaveAbility X2AbilityTemplate]
LocFriendlyName="Flux Weave"
LocLongDescription="Grants immunity to Disorientation, Stun and Unconciousness."
LocHelpText="Grants immunity to Disorientation, Stun and Unconciousness."
LocFlyOverText="Flux Weave"

[MZBubbleWeave X2EquipmentTemplate]
FriendlyName="Bubble Weave"
FriendlyNamePlural="Bubble Weaves"
BriefSummary="Body armor with Bubble Weave provides superior shielding that constantly recharges."
TacticalText="<Bullet/> Grants additional shielding, beyond what is normally provided by plating.<br/><Bullet/> Includes a built in generator that constantly recharges the available shield. <br/><Bullet/> Bubble Weave is one of the best choices for avoiding wounds." 

[MZBubbleWeaveAbility X2AbilityTemplate]
LocFriendlyName="Bubble Weave"
LocLongDescription="Shields constantly regenerate."
LocHelpText="Shields constantly regenerate."
LocFlyOverText="Bubble Weave"

[MZRepairWeave X2EquipmentTemplate]
FriendlyName="Automend Weave"
FriendlyNamePlural="Automend Weaves"
BriefSummary="Body armor with Automend Weave provides superior armour capable of repairing itself in the field."
TacticalText="<Bullet/> Grants additional armour.<br/><Bullet/> If any armour is shredded, Automending restores a small amount each turn." 

[MZRepairWeaveAbility X2AbilityTemplate]
LocFriendlyName="Automend Weave"
LocLongDescription="Shredded armour slowly regenerates."
LocHelpText="Shredded armour slowly regenerates."
LocFlyOverText="Automend Weave"

[MZMindWeave X2EquipmentTemplate]
FriendlyName="Mind Weave"
FriendlyNamePlural="Mind Weaves"
BriefSummary="Body armor with Mind Weave bolsters a soldier's psionic capability."
TacticalText="<Bullet/> Increases Psi Offense of the wearer. <br/><Bullet/>Additionaly, grants immunity to Panic." 

[MZMindWeaveAbility X2AbilityTemplate]
LocFriendlyName="Mind Weave"
LocLongDescription="Increased Psi Offense. Immunity to Panic."
LocHelpText="Increased Psi Offense. Immunity to Panic."
LocFlyOverText="Mind Weave"

[MZShimmerWeave X2EquipmentTemplate]
FriendlyName="Shimmer Weave"
FriendlyNamePlural="Shimmer Weaves"
BriefSummary="Made up of repurposed Archon flight systems that are integrated with the wearer's suit, the Shimmer Weave provides bursts of almost instant reaction time that allow them to maneuver against incoming attacks or impacts."
TacticalText="<Bullet/> Grants Lightning reflexes. <br/><Bullet/> Also gives immunity to knockback and falling damage." 

[MZShimmerWeaveAbility X2AbilityTemplate]
LocFriendlyName="Shimmer Weave"
LocLongDescription="Immune to knockbacks and falling damage."
LocHelpText="Immune to knockbacks and falling damage."
LocFlyOverText="Shimmer Weave"

[MZRegenWeave X2EquipmentTemplate]
FriendlyName="Regen Weave"
FriendlyNamePlural="Regen Weaves"
BriefSummary="Body armor with Regen Weave reroutes shield power to provide superior health and regeneration"
TacticalText="<Bullet/> Regen Weave converts initial shielding into health.<br/><Bullet/> Health regenerates over time.<br/><Bullet/> Ideal for soldiers who have abilities that scale with maximum health." 

[MZRegenWeaveAbility X2AbilityTemplate]
LocFriendlyName="Regen Weave"
LocLongDescription="Health regenerates over time."
LocHelpText="Health regenerates over time."
LocFlyOverText="Regen Weave"

[MZScabWeave X2EquipmentTemplate]
FriendlyName="Scab Weave"
FriendlyNamePlural="Scab Weaves"
BriefSummary="Scab Weave consists of a gelatine sublayer that is pressed onto the skin by various microservos, allowing it to close and disinfect a wound and encourage blood circulation within seconds after the soldier was hit."
TacticalText="<Bullet/> Provides immunity to bleeding.<br/><Bullet/> Heals a portion of wounds after battle, reducing time required to recover afterwards.<br/><Bullet/> For soldiers that can't avoid taking some damage, Scab Weave can allow them to get back into the field sooner." 

[MZScabWeaveAbility X2AbilityTemplate]
LocFriendlyName="Scab Weave"
LocLongDescription="Immunity to Bleeding. Reduces wounds after battle."
LocHelpText="Immunity to Bleeding. Reduces wounds after battle."
LocFlyOverText="Scab Weave"

[MZBlastWeave X2EquipmentTemplate]
FriendlyName="Blast Weave"
FriendlyNamePlural="Blast Weaves"
BriefSummary="Because nothing makes you feel safer than vest full of explosives."
TacticalText="<Bullet/> Can be detonated to deal explosive damage in an area around the wearer.<br/><Bullet/> If manually detonated, the soldier will barely survive and be left bleeding out. <br/><Bullet/> Damage scales with the soldier's maximum health and shield." 

[MZBlastWeaveAbility X2AbilityTemplate]
LocFriendlyName="Blast Weave"
LocLongDescription="Highly Explosive."
LocHelpText="Highly Explosive."
LocFlyOverText="Blast Weave"

[MZBlastWeaveDetonate X2AbilityTemplate]
LocFriendlyName="Blast Weave Detonation"
LocLongDescription="Detonate the Blast Weave to deal explosive damage in a large area around the <Ability:ClassName/>, but they will immediatly begin bleeding out."
LocHelpText="Detonate the Blast Weave to deal explosive damage in a large area around the <Ability:ClassName/>, but they will immediatly begin bleeding out."
LocFlyOverText="Blast Weave Detonation"

[MZBlastWeaveDeathExplosion X2AbilityTemplate]
LocFriendlyName="Blast Weave Detonation"
LocFlyOverText="Blast Weave Detonation"

